In [17]:
import sys
import pandas as pd
from IPython.display import HTML, display


%matplotlib inline

In [11]:
from datomico.structured import *

In [2]:
sys.executable

'/home/samuel/anaconda3/envs/datomico/bin/python'

In [4]:
%pwd

'/home/samuel/Documents/datomico'

In [5]:
!ls

data  prueba.ipynb  README.md

In [6]:
PATH = 'data/'

In [7]:
data_names = ['test', 'oil', 'holidays_events', 'stores','transactions', 'items'] # Falta train

In [8]:
data = [pd.read_csv(f'{PATH}{fname}.csv', low_memory=False) for fname in data_names]

In [10]:
for d in data: display(d.head())

          id        date  store_nbr  item_nbr  onpromotion
0  125497040  2017-08-16          1     96995        False
1  125497041  2017-08-16          1     99197        False
2  125497042  2017-08-16          1    103501        False
3  125497043  2017-08-16          1    103520        False
4  125497044  2017-08-16          1    103665        False

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

   item_nbr        family  class  perishable
0     96995     GROCERY I   1093           0
1     99197     GROCERY I   1067           0
2    103501      CLEANING   3008           0
3    103520     GROCERY I   1028           0
4    103665  BREAD/BAKERY   2712           1

In [12]:
sys.path

['',
 '/home/samuel/Documents/datomico',
 '/home/samuel/anaconda3/envs/datomico/lib/python37.zip',
 '/home/samuel/anaconda3/envs/datomico/lib/python3.7',
 '/home/samuel/anaconda3/envs/datomico/lib/python3.7/lib-dynload',
 '/home/samuel/anaconda3/envs/datomico/lib/python3.7/site-packages',
 '/home/samuel/anaconda3/envs/datomico/lib/python3.7/site-packages/IPython/extensions',
 '/home/samuel/.ipython']

In [13]:
test, oil, holidays_events, stores, transactions, items = data

In [14]:
len(test)

3370464

In [15]:
add_datepart(test, "date", drop=False)

In [16]:
display(test.head())

,id,date,store_nbr,item_nbr,onpromotion,Year,Month,Week,Day,Dayofweek,Dayofyear,Is_month_end,Is_month_start,Is_quarter_end,Is_quarter_start,Is_year_end,Is_year_start,Elapsed
0,125497040,2017-08-16,1,96995,False,2017,8,33,16,2,228,False,False,False,False,False,False,1502841600
1,125497041,2017-08-16,1,99197,False,2017,8,33,16,2,228,False,False,False,False,False,False,1502841600
2,125497042,2017-08-16,1,103501,False,2017,8,33,16,2,228,False,False,False,False,False,False,1502841600
3,125497043,2017-08-16,1,103520,False,2017,8,33,16,2,228,False,False,False,False,False,False,1502841600
4,125497044,2017-08-16,1,103665,False,2017,8,33,16,2,228,False,False,False,False,False,False,1502841600